app/controllers/likes_controller.rb

    def like_menager(role="like")
        @post = Message.find_by(id: params[role.to_sym][:post_id])
        back_or_root if @post.created_at < 5.minutes.ago || @post.nil?
        respond_to do |f|
            notice_message = ""
            change = 0
            if Like.where(user_id: current_user.id, message_id: @post.id).exists? || Dislike.where(user_id: current_user.id, message_id: @post.id).exists?
                flash[:warning] = "You've already voted for this message."
                back_or_root
            else
                if role == "like"
                    if Like.new(user_id: current_user.id, message_id: @post.id).save
                        change = 1
                        notice_message = "Liked!"
                    else
                        notice_message = "Error!"
                    end
                else
                    if Dislike.new(user_id: current_user.id, message_id: @post.id).save
                        change = -1
                        notice_message = "Disliked!"
                    else
                        notice_message = "Error!"
                    end
                end
                @post.update_attribute(:karma, @post.karma+change)
                current_user.update_attribute(:karma, current_user.karma+change)
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "dislikes".* FROM "dislikes" WHERE (user_id = 1 AND message_id = 272)
SELECT "likes".* FROM "likes" WHERE (user_id = 1 AND message_id = 269)
SELECT  1 AS one FROM "dislikes" WHERE "dislikes"."user_id" = $1 AND "dislikes"."message_id" = $2 LIMIT $3  [["user_id", 1], ["message_id", 4], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "message_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["message_id", 10], ["created_at", "2020-05-02 18:48:05.278735"], ["updated_at", "2020-05-02 18:48:05.278735"]]
INSERT INTO "likes" ("user_id", "message_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["message_id", 223], ["created_at", "2020-05-21 15:47:34.107938"], ["updated_at", "2020-05-21 15:47:34.107938"]]
INSERT INTO "dislikes" ("user_id", "message_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["message_id", 18], ["created_at", "2020-05-06 16:24:30.607741"], ["updated_at", "2020-05-06 16:24:30.607741"]]
UPDATE "messages" SET "karma" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["karma", 1], ["updated_at", "2020-05-02 18:48:05.699873"], ["id", 10]]
UPDATE "users" SET "karma" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["karma", -1], ["updated_at", "2020-04-25 16:14:26.543052"], ["id", 1]]
UPDATE "messages" SET "karma" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["karma", 1], ["updated_at", "2020-05-21 15:47:34.119079"], ["id", 223]]
UPDATE "users" SET "karma" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["karma", 2], ["updated_at", "2020-05-02 18:48:06.137136"], ["id", 2]]