app/controllers/posts_controller.rb

INSERT INTO "messages" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "first post"], ["user_id", 1], ["created_at", "2020-04-25 15:53:42.743915"], ["updated_at", "2020-04-25 15:53:42.743915"]]
---
    def create
        @post = current_user.messages.build(content: params[:post][:content])
        respond_to do |format|
            if @post.save