app/controllers/streams_controller.rb

  def show
    @stream = Message.where("created_at > ?", 5.minutes.ago)
              .order(created_at: :desc)
---
SELECT "messages".* FROM "messages" WHERE (created_at > '2020-05-07 13:36:38.293098') ORDER BY "messages"."created_at" DESC